import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from collections import Counter

meaningless_words = [
    'і', 'та', 'але', 'або', 'що', 'як', 'де', 'чи', 'з', 'на', 'від', 'під', 'по', 
    'під', 'за', 'від', 'до', 'у', 'під', 'в', 'для', 'без', 'над', 'про', 'після', 
    'проти', 'після', 'перед', 'через', 'після', 'попри', 'наперекір', 'понад', 
    'замість', 'відповідно', 'наприклад', 'оскільки', 'виходячи', 'будучи', 
    'поки', 'після', 'однак', 'проте', 'отже', 'також', 'так', 'ось', 'ось-ось', 
    'ніби', 'немов', 'наче', 'ж', 'же', 'прямо', 'то', 'би', 'то', 'іноді', 
    'можливо', 'зазвичай', 'навіть', 'майже', 'аби', 'лише', 'тільки', 'вже', 
    'ні', 'не', 'це', 'цей', 'цього', 'цю', 'цьому', 'цього', 'ці', 'цим', 
    'цієї', 'цьому', 'цим', 'свого', 'себе', 'собі', 'собою', 'собі', 'мені', 
    'тобі', 'його', 'її', 'їх', 'нам', 'вам', 'їм', 'їй', 'йому', 'їм', 'її', 
    'наш', 'ваш', 'їх', 'їм', 'їх', 'свій', 'всім', 'своїм', 'своєю', 'свій', 
    'своє', 'своїх', 'своїй', 'своїми', 'своєї', 'своїх', 'своїм', 'своїм', 
    'своїх', 'своїй', 'своїми', 'своєю', 'своїх', 'своїм', 'який', 'якою', 
    'яких', 'якому', 'якої', 'якими', 'якій', 'яким', 'якому', 'якого', 'які', 
    'якій', 'яких', 'якими', 'якому', 'якій', 'яким', 'якими', 'якій', 
    'якому', 'які', 'якою', 'якій', 'який', 'якій', 'якою', 'яким', 'якого', 
    'які', 'якій', 'які', 'якій', 'який', 'які', 'якій', 'якою', 'які', 'якій', 
    'якій', 'які', 'якою', 'які', 'якою', 'якої', 'яким', 'якій', 'якому', 'якого', 
    'які', 'якій', 'які', 'якою', 'яким', 'якій', 'якій', 'якій', 'якому', 'які', 
    'якому', 'якому', 'якої', 'якій', 'якому', 'якому', 'яким', 'якими', 'якої', 
    'якій', 'якій', 'якій', 'якому', 'якої', 'якій', 'які', 'якому', 'якої', 'якими', 
    'якому', 'яким', 'якими', 'якій', 'якими', 'яким', 'якому', 'якими', 'якої', 'якими', 
    'якому', 'якому', 'які', 'якій', 'якому', 'якому', 'яким', 'якими', 'якої', 'якій', 
    'якій', 'якому', 'якому', 'які', 'якій', 'якому', 'якому', 'яким', 'якими', 'якої', 
    'якій', 'якому', 'які', 'якому', 'якої', 'якими', 'якому', 'яким', 'якими', 'якій', 
    'якими', 'яким', 'якому', 'якими', 'якої', 'якими', 'якому', 'якому', 'які', 'якій', 
    'якому', 'якому', 'яким', 'якими', 'якої', 'якій', 'якій', 'якій', 'якому', 'якої', 
    'якій', 'які', 'якому', 'якої', 'якими', 'як']

def top_words(df: pd.DataFrame, top: int = 10, exclude: list = meaningless_words):

    """ Creates plot with top n used words"""

    df = df.dropna(subset=['Message'])

    word_counts = Counter()

    for i, row in df.iterrows():
        words = row['Message'].split()
        word_counts.update(words)

    filtered_word_counts = {word: count for word, count in word_counts.items() if len(word) > 1 and word not in exclude}
    filtered_word_counts = Counter(filtered_word_counts)

    top_words = filtered_word_counts.most_common(top)

    words = [word for word, _ in top_words]
    counts = [count for _, count in top_words]

    plt.figure(figsize=(10, 6))
    plt.bar(words, counts, edgecolor='k')
    plt.xlabel('Word')
    plt.ylabel('Count')
    plt.title('Most used words')
    plt.xticks(rotation=45, ha='right')
    plt.savefig(f"top_{top}_words.png", dpi=200)


def messages_count_chart(df: pd.DataFrame):
    """ Pie chart of the most active users """
    name_words = df['First Name'].value_counts()
    plt.pie(name_words.values, labels=name_words.index, autopct='%1.1f%%', startangle=90)
    plt.axis('equal')
    plt.title("Distribution of Messages")
    plt.savefig("messages_pie_chart.png", dpi=200)